results/fabio-512-run02/003_fio/cmd_210.output
io_uring_cmd-xnvme: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=xnvme, iodepth=4
fio-3.32-dirty
Starting 1 thread
{
  "fio version" : "fio-3.32-dirty",
  "timestamp" : 1666790147,
  "timestamp_ms" : 1666790147445,
  "time" : "Wed Oct 26 15:15:47 2022",
  "jobs" : [
    {
      "jobname" : "io_uring_cmd-xnvme",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "io_uring_cmd-xnvme",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "4",
        "bs" : "512",
        "direct" : "0",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "external:/usr/local/lib/x86_64-linux-gnu/libxnvme-fio-engine.so",
        "xnvme_be" : "linux",
        "xnvme_async" : "io_uring_cmd",
        "xnvme_sync" : "nvme",
        "xnvme_admin" : "nvme",
        "xnvme_dev_nsid" : "1",
        "filename" : "/dev/ng0n1",
        "cpus_allowed" : "1"
      },
      "read" : {
        "io_bytes" : 1479533568,
        "io_kbytes" : 1444857,
        "bw_bytes" : 211331748,
        "bw" : 206378,
        "iops" : 412756.891873,
        "runtime" : 7001,
        "total_ios" : 2889711,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 1232,
          "max" : 22802,
          "mean" : 1856.760263,
          "stddev" : 376.862601,
          "N" : 2889711
        },
        "clat_ns" : {
          "min" : 140,
          "max" : 125245,
          "mean" : 7527.013691,
          "stddev" : 2833.703087,
          "N" : 2889714,
          "percentile" : {
            "1.000000" : 4320,
            "5.000000" : 4896,
            "10.000000" : 5792,
            "20.000000" : 6624,
            "30.000000" : 6688,
            "40.000000" : 7136,
            "50.000000" : 7264,
            "60.000000" : 7328,
            "70.000000" : 7520,
            "80.000000" : 7904,
            "90.000000" : 8512,
            "95.000000" : 9408,
            "99.000000" : 20864,
            "99.500000" : 25216,
            "99.900000" : 27520,
            "99.950000" : 34048,
            "99.990000" : 69120
          }
        },
        "lat_ns" : {
          "min" : 5701,
          "max" : 127048,
          "mean" : 9383.773646,
          "stddev" : 2814.443814,
          "N" : 2889714
        },
        "bw_min" : 205006,
        "bw_max" : 208277,
        "bw_agg" : 100.000000,
        "bw_mean" : 206571.076923,
        "bw_dev" : 1108.539088,
        "bw_samples" : 13,
        "iops_min" : 410012,
        "iops_max" : 416554,
        "iops_mean" : 413142.153846,
        "iops_stddev" : 2216.807195,
        "iops_samples" : 13
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 19.342857,
      "sys_cpu" : 76.642857,
      "ctx" : 35152,
      "majf" : 0,
      "minf" : 0,
      "iodepth_level" : {
        "1" : 0.000000,
        "2" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.010000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.010000,
        "10" : 95.738432,
        "20" : 2.739409,
        "50" : 1.478556,
        "100" : 0.041319,
        "250" : 0.010000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 4,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ]
}

io_uring_cmd-xnvme: (groupid=0, jobs=1): err= 0: pid=8503: Wed Oct 26 15:15:47 2022
  read: IOPS=413k, BW=202MiB/s (211MB/s)(1411MiB/7001msec)
    slat (nsec): min=1232, max=22802, avg=1856.76, stdev=376.86
    clat (nsec): min=140, max=125245, avg=7527.01, stdev=2833.70
     lat (usec): min=5, max=127, avg= 9.38, stdev= 2.81
    clat percentiles (nsec):
     |  1.00th=[ 4320],  5.00th=[ 4896], 10.00th=[ 5792], 20.00th=[ 6624],
     | 30.00th=[ 6688], 40.00th=[ 7136], 50.00th=[ 7264], 60.00th=[ 7328],
     | 70.00th=[ 7520], 80.00th=[ 7904], 90.00th=[ 8512], 95.00th=[ 9408],
     | 99.00th=[20864], 99.50th=[25216], 99.90th=[27520], 99.95th=[34048],
     | 99.99th=[69120]
   bw (  KiB/s): min=205006, max=208277, per=100.00%, avg=206571.08, stdev=1108.54, samples=13
   iops        : min=410012, max=416554, avg=413142.15, stdev=2216.81, samples=13
  lat (nsec)   : 250=0.01%
  lat (usec)   : 4=0.01%, 10=95.74%, 20=2.74%, 50=1.48%, 100=0.04%
  lat (usec)   : 250=0.01%
  cpu          : usr=19.34%, sys=76.64%, ctx=35152, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2889711,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=202MiB/s (211MB/s), 202MiB/s-202MiB/s (211MB/s-211MB/s), io=1411MiB (1480MB), run=7001-7001msec